/***********************************************************
 * 版权信息: 李华锋同学，保留一切权利
 * 文件名称: tree.h
 * 文件作者: lihf
 * 完成日期: 2018-11-03
 * 当前版本:
 * 主要功能: tree模块头文件
 * 版本历史:
 ***********************************************************/
#ifndef __TREEE_H__
#define __TREEE_H__

/********************************************************************************************************
 *                                           File Include                                               *
 ********************************************************************************************************/
#include "list.h"

/********************************************************************************************************
 *                                    Macros/Defines/Structures                                         *
 ********************************************************************************************************/
#define NOTE_ROOT_INIT(node) { {&node.head, &node.head}, PTHREAD_MUTEX_INITIALIZER }

typedef struct
{
    list_node_t     head;
    pthread_mutex_t tree_lock;
}s_tree_root_t;

/********************************************************************************************************
 *                                        Declar Functions                                              *
 ********************************************************************************************************/

/***********************************************************
 * 函数名称：tree_add
 * 功能描述：将name_list表示的配置项和节点，添加到树链表中
 * 输入参数：name_list  字符串形式("xxx->xxx->xxx")，表示的父节点和子节点之间的关系
             value      末尾节点的值，字符串表示
             value_len  字符串值的长度
 * 输出参数：无
 * 返 回 值：NO_ERROR
             ERROR
 ***********************************************************/
int tree_add(const u8 *name_list, const void *value, const int value_len);

#endif

